Repository: qbobaid/NotesApp
Catalog: lib/l10n/intl_*.arb
Languages: ur

# logout_button
source: Log out
ur: لاگ آوٹ

source: Note
ur: نوٹ

source: Cancel
ur: منسوخ

source: Yes
ur: جی ہاں

source: Delete
ur: حذف کریں۔

source: Sharing
ur: شیئرنگ

source: OK
ur: ٹھیک ہے

source: Login
ur: لاگ ان کریں

source: Verify email
ur: ای میل کی تصدیق کریں۔

source: Register
ur: رجسٹر کریں۔

source: Restart
ur: دوبارہ شروع کریں

source: Start typing your note
ur: اپنا نوٹ ٹائپ کرنا شروع کریں۔

# delete_note_prompt
source: Are you sure you want to delete this note?
ur: کیا آپ واقعی اس نوٹ کو حذف کرنا چاہتے ہیں؟

# cannot_share_empty_note_prompt
source: Cannot share an empty note!
ur: خالی نوٹ کا اشتراک نہیں کیا جا سکتا!

# generic_error_prompt
source: An error occurred
ur: ایک خرابی آگئی

# logout_dialog_prompt
source: Are you sure you want to log out?
ur: کیا آپ واقعی لاگ آؤٹ کرنا چاہتے ہیں؟

source: Password reset
ur: پاس ورڈ ری سیٹ

# password_reset_dialog_prompt
source: We have sent you an email to reset your password. Please check your email
ur: ہم نے آپ کو اپنا پاس ورڈ دوبارہ ترتیب دینے کے لیے ایک ای میل بھیجی ہے۔ براہ کرم اپنا ای میل چیک کریں۔

# login_error_cannot_find_user
source: Cannot find a user with the entered credentials!
ur: درج کردہ اسناد کے ساتھ صارف نہیں مل سکتا!

# login_error_wrong_credentials
source: Wrong credentials
ur: غلط اسناد

# login_error_auth_error
source: Authentication error
ur: تصدیق کی غلطی

# login_view_prompt
source: Please log in to your account in order to interact with notes app!
ur: نوٹ ایپ کے ساتھ تعامل کرنے کے لیے براہ کرم اپنے اکاؤنٹ میں لاگ ان کریں۔

# login_view_forgot_password
source: I forgot my password
ur: پاسورڈ بھول گے؟

# login_view_not_registered_yet
source: Not registered yet? Register here!
ur: ابھی تک رجسٹر نہیں ہوا؟ یہاں اندراج کریں!

# email_text_field_placeholder
source: Enter your email here
ur: اپنا ای میل یہاں درج کریں۔

# password_text_field_placeholder
source: Enter your password here
ur: یہاں اپنا پاس ورڈ درج کریں۔

source: Forgot Password
ur: پاسورڈ بھول گے

# forgot_password_invalid_email
source: User in not registered, please register a user by going back one step
ur: صارف رجسٹرڈ نہیں ہے، براہ کرم ایک قدم پیچھے جا کر صارف کو رجسٹر کریں۔

# forgot_password_user_not_registered
source: Invalid email, please provide a valid email
ur: غلط ای میل، براہ کرم ایک درست ای میل فراہم کریں۔

# forgot_password_view_generic_error
source: Unable to process your request. Please make sure you are a registered user, if not, please register a user by going back one step
ur: ہم آپ کی درخواست پر کارروائی نہیں کر سکے۔ براہ کرم یقینی بنائیں کہ آپ رجسٹرڈ صارف ہیں، یا اگر نہیں، تو ایک قدم پیچھے جا کر ابھی صارف کو رجسٹر کریں۔

# forgot_password_view_prompt
source: If you forgot your password, Please enter your email below so we can send you a password reset link in your email
ur: اگر آپ اپنا پاس ورڈ بھول گئے ہیں، تو براہ کرم نیچے اپنا ای میل درج کریں تاکہ ہم آپ کو آپ کے ای میل میں پاس ورڈ دوبارہ ترتیب دینے کا لنک بھیج سکیں

# forgot_password_view_send_me_link
source: Send me password reset link
ur: مجھے پاس ورڈ دوبارہ ترتیب دینے کا لنک بھیجیں۔

# forgot_password_view_back_to_login
source: Back to login
ur: لاگ ان پر واپس جائیں۔

# register_error_weak_password
source: This password is not secure enough. Please choose another password!
ur: یہ پاس ورڈ کافی محفوظ نہیں ہے۔ براہ کرم دوسرا پاس ورڈ منتخب کریں!

# register_error_email_already_in_use
source: This email is already registered to another user. Please choose another email!
ur: یہ ای میل پہلے ہی کسی دوسرے صارف کے لیے رجسٹرڈ ہے۔ براہ کرم دوسرا ای میل منتخب کریں!

# register_error_generic
source: Failed to register. Please try again later!
ur: رجسٹر کرنے میں ناکام۔ براہ کرم کچھ دیر بعد کوشش کریں!

# register_error_invalid_email
source: The email address you entered appears to be invalid. Please try another email address!
ur: آپ کا درج کردہ ای میل پتہ غلط معلوم ہوتا ہے۔ براہ کرم دوسرا ای میل پتہ آزمائیں!

# register_view_prompt
source: Enter your email and password to register into notes application
ur: نوٹس ایپلی کیشن میں رجسٹر کرنے کے لیے اپنا ای میل اور پاس ورڈ درج کریں۔

# register_view_already_registered
source: Already registered? Login here!
ur: پہلے سے رجسٹرڈ ہیں؟ یہاں لاگ ان کریں!

# verify_email_view_prompt
source: We've sent you an email verification. Please open it to verify your account. If you haven't received a verification email yet, press the button below!
ur: ہم نے آپ کو ایک ای میل تصدیق بھیجی ہے۔ اپنے اکاؤنٹ کی تصدیق کے لیے اسے کھولیں۔ اگر آپ کو ابھی تک توثیقی ای میل موصول نہیں ہوئی ہے تو نیچے دیئے گئے بٹن کو دبائیں!

# verify_email_send_email_verification
source: Send email verification
ur: ای میل کی توثیق بھیجیں۔

# notes_title
source: {count, plural, =0{No notes yet} =1{1 note} other{{count} notes}}
ur: {count, plural, =0{ابھی تک کوئی نوٹس نہیں ہے۔} =1{1 note} other{{count} نوٹ}}
